//1.Четем от конзолата 
//•	Брой турнири, в които е участвал – цяло число в интервала [1…20] 
//•	Начален брой точки в ранглистата - цяло число в интервала [1...4000]
//За всеки турнир се прочита отделен ред:
//•	Достигнат етап от турнира – текст – "W", "F" или "SF"
//	W - ако е победител получава 2000 точки
//	F - ако е финалист получава 1200 точки
//	SF - ако е полуфиналист получава 720 точки
int turnirs = int.Parse(Console.ReadLine());
int points = int.Parse(Console.ReadLine());

double w = 2000;
double f = 1200;
double sf = 720;
double numW = 0;
double allPoints = 0;
for (int i = 0; i <= turnirs; i++)
{
    string typeTurnir = Console.ReadLine();

	if (typeTurnir == "F")
	{
		allPoints = points + f;
	}

	else if (typeTurnir == "SF")
	{
        allPoints = points + sf;
    }

    else if (typeTurnir == "W")
    {
        allPoints = points + w;
        numW += numW;
    }

    allPoints = allPoints + points;

}
allPoints /= 5;



//2.Изчисляваме точките след изиграване на всички турнири + точките, с които стартира сезона
//==> изчисляват се средно колко точки печели от всички изиграни турнири
//==> изчисляват се колко процента от турнирите е спечелил

//3.Отпечатваме изхода на конзолата
//•	"Final points: {брой точки след изиграните турнири}"
//•	"Average points: {средно колко точки печели за турнир}"
//•	"{процент спечелени турнири}%"
//==> Средните точки да бъдат закръглени към най-близкото цяло число надолу,
//а процентът да се форматира до втората цифра след десетичния знак.