//1. Четем от конзолата каква е таксата за една година
//2.Намиреаме каква е цената за всеки компонент от екипировата
//•	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
//•	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
//•	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
//•	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
//3. Намираме колко общо са разходите за таксата + екипировката
//4. Отпечатваме резултата на конзолата

int taxPerYear = int.Parse(Console.ReadLine());
double shoes = taxPerYear - (taxPerYear * 0.4); //=> shoes = taxPerYEar * 40 / 100
double outfit = shoes - (shoes * 0.2); //=> outfit = shoes * 20 / 100
double ball = outfit / 4; //=> 1/4 of outfit
double acc = ball / 5; //=> 1/5 of ball
double sum = taxPerYear + shoes + outfit + ball + acc;
Console.WriteLine(sum);