namespace _03._08._24
{
    internal class Program
    {
        static void Main(string[] args)
        {
            string n = "\"Няма нещо, за което, ако има желание да се постигне договореност да не може да бъде постигната в рамките на няколко дни. Това е въпрос на политическа Воля. Силно притеснен съм, че няма сериозен политически разговор. Виждаме канонада от политически нападки и подхвърляния от това, че отиваме на избори до това, че ще се разберем. Притеснението ми е продиктувано от това, че в момента се намираме в ключов политически момент и трябва да водим сериозен разговор за държавата. За това как продължава да функционира изпълнителната и парламентарната власт\", обясни той.\r\n\r\nПо думите му трябва да се сложи край на плаващите мнозинства в 49-ото Народно събрание.\r\n\r\n\"Ако има политическа сила в България, която обяви, че не може да се бори с корупцията, значи не мисли за държавата и българските граждани\", каза още Йордан Иванов.";
            foreach (var i in n)
            {
                Console.Write(i);
                Thread.Sleep(100);
            }
        }
    }
}
